Test/LR/lr_fpjy_2ci/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action></wsa:Action><wsa:MessageID>uuid:fb789ba7-41bf-4119-ab76-b373640d58fb</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://172.25.2.62:6010/yys-lt-upload/services/ElectronInvoiceSer</wsa:To></soap:Header><soap:Body><checkElectronInvoice xmlns="http://unientry.sn.tradeswitch.unicom.com"><in0>&lt;QryCdrOfVaInfoOutput&gt;&lt;UNI_BSS_HEAD&gt;&lt;ORIG_DOMAIN&gt; PTIS&lt;/ORIG_DOMAIN&gt;&lt;SERVICE_NAME&gt;ElectronInvoiceSer&lt;/SERVICE_NAME&gt;&lt;OPERATE_NAME&gt;checkElectronInvoice&lt;/OPERATE_NAME&gt;&lt;ACTION_CODE&gt;0&lt;/ACTION_CODE&gt;&lt;ACTION_RELATION&gt;0&lt;/ACTION_RELATION&gt;&lt;ROUTING&gt; &lt;ROUTE_TYPE&gt;00&lt;/ROUTE_TYPE&gt; &lt;ROUTE_VALUE&gt;11&lt;/ROUTE_VALUE&gt;&lt;/ROUTING&gt;&lt;PROC_ID&gt;lyl001&lt;/PROC_ID&gt;&lt;TRANS_IDO&gt; lyl001&lt;/TRANS_IDO&gt;&lt;TRANS_IDH&gt; &lt;/TRANS_IDH&gt;  &lt;PROCESS_TIME&gt;200806081204&lt;/PROCESS_TIME&gt;&lt;RESPONSE&gt;&lt;RSP_TYPE&gt;&lt;/RSP_TYPE&gt;&lt;RSP_CODE&gt;&lt;/RSP_CODE&gt;&lt;/RESPONSE&gt;&lt;COM_BUS_INFO&gt;&lt;OPER_ID&gt;00029345sunhong&lt;/OPER_ID&gt;&lt;PROVINCE_CODE&gt;0011&lt;/PROVINCE_CODE&gt;&lt;/COM_BUS_INFO&gt;&lt;SP_RESERVE&gt;&lt;TRANS_IDC&gt;ECIP0002seq00001&lt;/TRANS_IDC&gt;&lt;CUTOFFDAY&gt;20080608&lt;/CUTOFFDAY&gt;&lt;OSNDUNS&gt;0002&lt;/OSNDUNS&gt;&lt;HSNDUNS&gt;1100&lt;/HSNDUNS&gt;&lt;CONV_ID&gt;ECIP0002seq00001200806081200111&lt;/CONV_ID&gt;&lt;/SP_RESERVE&gt;&lt;TEST_FLAG&gt;0&lt;/TEST_FLAG&gt;&lt;MSG_SENDER&gt;1100&lt;/MSG_SENDER&gt;&lt;MSG_RECEIVER&gt;1101&lt;/MSG_RECEIVER&gt;&lt;/UNI_BSS_HEAD&gt;&lt;UNI_BSS_BODY&gt;&lt;CHECK_ELECTRON_INVOICE_REQ&gt;&lt;INVOICE_CODE&gt;000003521012&lt;/INVOICE_CODE&gt;&lt;INVOICE_NUM&gt;32080451&lt;/INVOICE_NUM&gt;&lt;TOTAL_FEE&gt;117&lt;/TOTAL_FEE&gt;&lt;MAKE_INVOICE_DATE&gt;20160312&lt;/MAKE_INVOICE_DATE&gt;&lt;PARA&gt;&lt;/PARA&gt;&lt;PARA_ID&gt;&lt;/PARA_ID&gt;&lt;PARA_VALUE&gt;&lt;/PARA_VALUE&gt;&lt;/CHECK_ELECTRON_INVOICE_REQ&gt;&lt;/UNI_BSS_BODY&gt;&lt;UNI_BSS_ATTACHED&gt;&lt;MEDIA_INFO&gt;&lt;/MEDIA_INFO&gt;&lt;/UNI_BSS_ATTACHED&gt;&lt;/QryCdrOfVaInfoOutput&gt;</in0></checkElectronInvoice></soap:Body></soap:Envelope>