Test/LR/lr_fpjy_2ci/result1/Iteration1/t1_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files\HP\LoadRunner">
  <http>
    <request>
      <header>POST /yys-lt-upload/services/ElectronInvoiceSer HTTP/1.1
Content-Type: text/xml; charset=utf-8
Cache-Control: no-cache
SOAPAction: ""
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept-Language: zh-CN
Accept: */*
Connection: Keep-Alive
Host: 172.25.2.62:6010
Content-Length: 2473

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"&gt;
  &lt;soap:Header&gt;
    &lt;wsa:Action&gt;
    &lt;/wsa:Action&gt;
    &lt;wsa:MessageID&gt;uuid:fb789ba7-41bf-4119-ab76-b373640d58fb&lt;/wsa:MessageID&gt;
    &lt;wsa:ReplyTo&gt;
      &lt;wsa:Address&gt;http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous&lt;/wsa:Address&gt;
    &lt;/wsa:ReplyTo&gt;
    &lt;wsa:To&gt;http://172.25.2.62:6010/yys-lt-upload/services/ElectronInvoiceSer&lt;/wsa:To&gt;
  &lt;/soap:Header&gt;
  &lt;soap:Body&gt;
    &lt;checkElectronInvoice xmlns="http://unientry.sn.tradeswitch.unicom.com"&gt;
      &lt;in0&gt;&amp;lt;QryCdrOfVaInfoOutput&amp;gt;&amp;lt;UNI_BSS_HEAD&amp;gt;&amp;lt;ORIG_DOMAIN&amp;gt; PTIS&amp;lt;/ORIG_DOMAIN&amp;gt;&amp;lt;SERVICE_NAME&amp;gt;ElectronInvoiceSer&amp;lt;/SERVICE_NAME&amp;gt;&amp;lt;OPERATE_NAME&amp;gt;checkElectronInvoice&amp;lt;/OPERATE_NAME&amp;gt;&amp;lt;ACTION_CODE&amp;gt;0&amp;lt;/ACTION_CODE&amp;gt;&amp;lt;ACTION_RELATION&amp;gt;0&amp;lt;/ACTION_RELATION&amp;gt;&amp;lt;ROUTING&amp;gt; &amp;lt;ROUTE_TYPE&amp;gt;00&amp;lt;/ROUTE_TYPE&amp;gt; &amp;lt;ROUTE_VALUE&amp;gt;11&amp;lt;/ROUTE_VALUE&amp;gt;&amp;lt;/ROUTING&amp;gt;&amp;lt;PROC_ID&amp;gt;lyl001&amp;lt;/PROC_ID&amp;gt;&amp;lt;TRANS_IDO&amp;gt; lyl001&amp;lt;/TRANS_IDO&amp;gt;&amp;lt;TRANS_IDH&amp;gt; &amp;lt;/TRANS_IDH&amp;gt;  &amp;lt;PROCESS_TIME&amp;gt;200806081204&amp;lt;/PROCESS_TIME&amp;gt;&amp;lt;RESPONSE&amp;gt;&amp;lt;RSP_TYPE&amp;gt;&amp;lt;/RSP_TYPE&amp;gt;&amp;lt;RSP_CODE&amp;gt;&amp;lt;/RSP_CODE&amp;gt;&amp;lt;/RESPONSE&amp;gt;&amp;lt;COM_BUS_INFO&amp;gt;&amp;lt;OPER_ID&amp;gt;00029345sunhong&amp;lt;/OPER_ID&amp;gt;&amp;lt;PROVINCE_CODE&amp;gt;0011&amp;lt;/PROVINCE_CODE&amp;gt;&amp;lt;/COM_BUS_INFO&amp;gt;&amp;lt;SP_RESERVE&amp;gt;&amp;lt;TRANS_IDC&amp;gt;ECIP0002seq00001&amp;lt;/TRANS_IDC&amp;gt;&amp;lt;CUTOFFDAY&amp;gt;20080608&amp;lt;/CUTOFFDAY&amp;gt;&amp;lt;OSNDUNS&amp;gt;0002&amp;lt;/OSNDUNS&amp;gt;&amp;lt;HSNDUNS&amp;gt;1100&amp;lt;/HSNDUNS&amp;gt;&amp;lt;CONV_ID&amp;gt;ECIP0002seq00001200806081200111&amp;lt;/CONV_ID&amp;gt;&amp;lt;/SP_RESERVE&amp;gt;&amp;lt;TEST_FLAG&amp;gt;0&amp;lt;/TEST_FLAG&amp;gt;&amp;lt;MSG_SENDER&amp;gt;1100&amp;lt;/MSG_SENDER&amp;gt;&amp;lt;MSG_RECEIVER&amp;gt;1101&amp;lt;/MSG_RECEIVER&amp;gt;&amp;lt;/UNI_BSS_HEAD&amp;gt;&amp;lt;UNI_BSS_BODY&amp;gt;&amp;lt;CHECK_ELECTRON_INVOICE_REQ&amp;gt;&amp;lt;INVOICE_CODE&amp;gt;000003521012&amp;lt;/INVOICE_CODE&amp;gt;&amp;lt;INVOICE_NUM&amp;gt;32080451&amp;lt;/INVOICE_NUM&amp;gt;&amp;lt;TOTAL_FEE&amp;gt;117&amp;lt;/TOTAL_FEE&amp;gt;&amp;lt;MAKE_INVOICE_DATE&amp;gt;20160312&amp;lt;/MAKE_INVOICE_DATE&amp;gt;&amp;lt;PARA&amp;gt;&amp;lt;/PARA&amp;gt;&amp;lt;PARA_ID&amp;gt;&amp;lt;/PARA_ID&amp;gt;&amp;lt;PARA_VALUE&amp;gt;&amp;lt;/PARA_VALUE&amp;gt;&amp;lt;/CHECK_ELECTRON_INVOICE_REQ&amp;gt;&amp;lt;/UNI_BSS_BODY&amp;gt;&amp;lt;UNI_BSS_ATTACHED&amp;gt;&amp;lt;MEDIA_INFO&amp;gt;&amp;lt;/MEDIA_INFO&amp;gt;&amp;lt;/UNI_BSS_ATTACHED&amp;gt;&amp;lt;/QryCdrOfVaInfoOutput&amp;gt;&lt;/in0&gt;
    &lt;/checkElectronInvoice&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
Content-Type: text/xml;charset=UTF-8
Transfer-Encoding: chunked
Date: Sat, 12 Mar 2016 08:34:47 GMT

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
  &lt;soap:Body&gt;
    &lt;ns1:checkElectronInvoiceResponse xmlns:ns1="http://unientry.sn.tradeswitch.unicom.com"&gt;
      &lt;ns1:out&gt;&amp;lt;checkElectronInvoiceOutput&amp;gt;
&amp;lt;UNI_BSS_HEAD&amp;gt;
	&amp;lt;ORIG_DOMAIN&amp;gt;EISP&amp;lt;/ORIG_DOMAIN&amp;gt;
	&amp;lt;SERVICE_NAME&amp;gt;ElectronInvoiceSer&amp;lt;/SERVICE_NAME&amp;gt;
	&amp;lt;OPERATE_NAME&amp;gt;checkElectronInvoice&amp;lt;/OPERATE_NAME&amp;gt;
	&amp;lt;ACTION_CODE&amp;gt;1&amp;lt;/ACTION_CODE&amp;gt;
	&amp;lt;ACTION_RELATION&amp;gt;0&amp;lt;/ACTION_RELATION&amp;gt;
	&amp;lt;ROUTING&amp;gt;
		&amp;lt;ROUTE_TYPE&amp;gt;&amp;lt;/ROUTE_TYPE&amp;gt;
		&amp;lt;ROUTE_VALUE&amp;gt;&amp;lt;/ROUTE_VALUE&amp;gt;
	&amp;lt;/ROUTING&amp;gt;
	&amp;lt;PROC_ID&amp;gt;lyl001&amp;lt;/PROC_ID&amp;gt;
	&amp;lt;TRANS_IDO&amp;gt; lyl001&amp;lt;/TRANS_IDO&amp;gt;
	&amp;lt;TRANS_IDH&amp;gt;1457771687306154118705331596&amp;lt;/TRANS_IDH&amp;gt;
	&amp;lt;PROCESS_TIME&amp;gt;20160312163447&amp;lt;/PROCESS_TIME&amp;gt;
	&amp;lt;RESPONSE&amp;gt;
		&amp;lt;RSP_TYPE&amp;gt;0&amp;lt;/RSP_TYPE&amp;gt;
		&amp;lt;RSP_CODE&amp;gt;1328&amp;lt;/RSP_CODE&amp;gt;
	&amp;lt;/RESPONSE&amp;gt;
	&amp;lt;COM_BUS_INFO&amp;gt;
		&amp;lt;OPER_ID&amp;gt;&amp;lt;/OPER_ID&amp;gt;
		&amp;lt;PROVINCE_CODE&amp;gt;&amp;lt;/PROVINCE_CODE&amp;gt;
	&amp;lt;/COM_BUS_INFO&amp;gt;
	&amp;lt;SP_RESERVE&amp;gt;
		&amp;lt;TRANS_IDC&amp;gt;ECIP0002seq00001&amp;lt;/TRANS_IDC&amp;gt;
		&amp;lt;CUTOFFDAY&amp;gt;20080608&amp;lt;/CUTOFFDAY&amp;gt;
		&amp;lt;OSNDUNS&amp;gt;&amp;lt;/OSNDUNS&amp;gt;
		&amp;lt;HSNDUNS&amp;gt;1100&amp;lt;/HSNDUNS&amp;gt;
		&amp;lt;CONV_ID&amp;gt;ECIP0002seq00001200806081200111&amp;lt;/CONV_ID&amp;gt;
	&amp;lt;/SP_RESERVE&amp;gt;
	&amp;lt;TEST_FLAG&amp;gt;1&amp;lt;/TEST_FLAG&amp;gt;
	&amp;lt;MSG_SENDER&amp;gt;&amp;lt;/MSG_SENDER&amp;gt;
	&amp;lt;MSG_RECEIVER&amp;gt;&amp;lt;/MSG_RECEIVER&amp;gt;
&amp;lt;/UNI_BSS_HEAD&amp;gt;
&amp;lt;UNI_BSS_BODY&amp;gt;
  &amp;lt;CHECK_ELECTRON_INVOICE_RSP&amp;gt;
    &amp;lt;RESP_CODE&amp;gt;1328&amp;lt;/RESP_CODE&amp;gt;
	&amp;lt;RESP_DESC&amp;gt;发票不存在&amp;lt;/RESP_DESC&amp;gt;
	&amp;lt;PARA&amp;gt;
	  &amp;lt;PARA_ID&amp;gt;&amp;lt;/PARA_ID&amp;gt;
	  &amp;lt;PARA_VALUE&amp;gt;&amp;lt;/PARA_VALUE&amp;gt;
	&amp;lt;/PARA&amp;gt;
  &amp;lt;/CHECK_ELECTRON_INVOICE_RSP&amp;gt;
&amp;lt;/UNI_BSS_BODY&amp;gt;
&amp;lt;UNI_BSS_ATTACHED&amp;gt;
	&amp;lt;MEDIA_INFO&amp;gt;&amp;lt;/MEDIA_INFO&amp;gt;
&amp;lt;/UNI_BSS_ATTACHED&amp;gt;
&amp;lt;/checkElectronInvoiceOutput&amp;gt;&lt;/ns1:out&gt;
    &lt;/ns1:checkElectronInvoiceResponse&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </response>
  </http>
</report>